BaseConfiguration/Money_2_0/AccumulationRegisters/ОборотыПлановыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыПлановыхОпераций</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РазделБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФинансовыеЦели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБюджетныхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтатьяБюджета</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьГрафаБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьШаблонОперации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ДатыРасписаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДатыРасписаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АктуальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пропустить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВладелецРасписания</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/AccumulationRegisters/ОборотыПлановыхОпераций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПроверитьЗаписиРегистра(БылиОшибки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Даты.ПлановаяОперация КАК ПлановаяОперация
	|ИЗ
	|	РегистрСведений.ДатыРасписаний КАК Даты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыПлановыхОпераций КАК ОборотыПлановыхОпераций
	|		ПО (Даты.ПлановаяОперация = ОборотыПлановыхОпераций.Регистратор)
	|ГДЕ
	|	Даты.ПлановаяОперация = Даты.ВладелецРасписания
	|	И ОборотыПлановыхОпераций.Регистратор.Ссылка есть NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.ПлановаяОперация) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ДокОбъект = Выборка.ПлановаяОперация.ПолучитьОбъект();
			Если ДокОбъект <> Неопределено Тогда
				ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			КонецЕсли;
		Исключение
			БылиОшибки = Истина;
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Плановые операции", 
						УровеньЖурналаРегистрации.Ошибка, , Выборка.ПлановаяОперация, 
						СтрШаблон(НСтр("ru='Не удалось перезаписать плановую операцию %1 (%2)
						|	%3'"), Выборка.ПлановаяОперация, ТипЗнч(Выборка.ПлановаяОперация), ПодробноеПредставлениеОшибки(Ошибка)));
		КонецПопытки;
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Даты.ВладелецРасписания КАК ВладелецРасписания
	|ИЗ
	|	РегистрСведений.ДатыРасписаний КАК Даты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыПлановыхОпераций КАК ОборотыПлановыхОпераций
	|		ПО (Даты.ВладелецРасписания = ОборотыПлановыхОпераций.Регистратор)
	|ГДЕ
	|	Даты.ПлановаяОперация <> Даты.ВладелецРасписания
	|	И ОборотыПлановыхОпераций.Регистратор есть NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.ВладелецРасписания) Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			ДокОбъект = Выборка.ВладелецРасписания.ПолучитьОбъект();
			Если ДокОбъект <> Неопределено Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		Исключение
			БылиОшибки = Истина;
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Плановые операции", 
						УровеньЖурналаРегистрации.Ошибка, , Выборка.ВладелецРасписания, 
						СтрШаблон(НСтр("ru='Не удлаось перезаписать шаблон %1 (%2)
						|	%3'"), Выборка.ВладелецРасписания, ТипЗнч(Выборка.ВладелецРасписания), ПодробноеПредставлениеОшибки(Ошибка)));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
